data/ping.dot
digraph {
  rankdir=LR;

  start[shape=rect, label="Ping"];

  serial_decoder_id[shape=diamond, label="SN != 0 && ID != 0"];
  start->serial_decoder_id;

  serial_decoder_id_equal[shape=diamond, label="SN == own SN &&\nID == own ID"];
  serial_decoder_id->serial_decoder_id_equal[label="true"];

  serial[shape=diamond, label="SN != 0"];
  serial_decoder_id->serial[label="false"];

  serial_equal[shape=diamond, label="SN == own SN"];
  serial->serial_equal[label="true"];

  decoder_id[shape=diamond, label="ID != 0"];
  serial->decoder_id[label="false"];

  decoder_id_equal[shape=diamond, label="ID == own ID"];
  decoder_id->decoder_id_equal[label="true"];

  select[label="selected"];
  serial_decoder_id_equal->select[label="true"];
  serial_equal->select[label="true"];
  decoder_id_equal->select[label="true"];
  decoder_id->select[label="false"];

  deselect[label="deselected"];
  serial_decoder_id_equal->deselect[label="false"];
  serial_equal->deselect[label="false"];
  decoder_id_equal->deselect[label="false"];
}
